fixed image locations
